In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
df=pd.read_csv('online_retail_II.csv')

Invoice number start with C, it is a refund

Understanding Business Problem

In [4]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,1/12/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,1/12/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,1/12/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,1/12/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,1/12/2010 8:26,3.39,17850.0,United Kingdom

In [5]:
df.describe()

            Quantity          Price    Customer ID
count  541910.000000  541910.000000  406830.000000
mean        9.552234       4.611138   15287.684160
std       218.080957      96.759765    1713.603074
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541910 entries, 0 to 541909
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      541910 non-null  object
 1   StockCode    541910 non-null  object
 2   Description  540456 non-null  object
 3   Quantity     541910 non-null  int64
 4   InvoiceDate  541910 non-null  object
 5   Price        541910 non-null  float64
 6   Customer ID  406830 non-null  float64
 7   Country      541910 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

Number of unique product

In [8]:
df["Description"].nunique()

4223

the most purchased product

In [9]:
df.groupby("Description").agg({"Quantity":"sum", "Price":"sum"}).sort_values("Quantity", ascending = False).head(10)

                                    Quantity    Price
Description
WORLD WAR 2 GLIDERS ASSTD DESIGNS      53847   173.39
JUMBO BAG RED RETROSPOT                47363  5333.30
ASSORTED COLOUR BIRD ORNAMENT          36381  2584.77
POPCORN HOLDER                         36334   874.50
PACK OF 72 RETROSPOT CAKE CASES        36039  1047.04
WHITE HANGING HEART T-LIGHT HOLDER     35317  7590.87
RABBIT NIGHT LIGHT                     30680  2496.53
MINI PAINT SET VINTAGE                 26437   304.81
PACK OF 12 LONDON TISSUES              26315   236.87
PACK OF 60 PINK PAISLEY CAKE CASES     24753   664.13

the most returned product

In [10]:
df.groupby(["Invoice","Description"] ).agg({"Quantity":"sum"}).sort_values("Quantity", ascending=True).head()

                                             Quantity
Invoice Description
C581484 PAPER CRAFT , LITTLE BIRDIE            -80995
C541433 MEDIUM CERAMIC TOP STORAGE JAR         -74215
556691  printing smudges/thrown away            -9600
556690  printing smudges/thrown away            -9600
C536757 ROTATING SILVER ANGELS T-LIGHT HLDR     -9360

Missing value

In [11]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
Price               0
Customer ID    135080
Country             0
dtype: int64

In [12]:
df.dropna(inplace = True)

In [13]:
df["Customer ID"] = df["Customer ID"].astype(int)
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,1/12/2010 8:26,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,1/12/2010 8:26,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,1/12/2010 8:26,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,1/12/2010 8:26,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,1/12/2010 8:26,3.39,17850,United Kingdom

store the refund invoice into df_C

In [14]:
df_C = df[df["Invoice"].str.contains("C")==True]

In [16]:
df_C.groupby("Description").agg({"Quantity":"sum"}).sort_values("Quantity", ascending = True).head(10)

                                     Quantity
Description
PAPER CRAFT , LITTLE BIRDIE            -80995
MEDIUM CERAMIC TOP STORAGE JAR         -74494
ROTATING SILVER ANGELS T-LIGHT HLDR     -9367
Manual                                  -3995
FAIRY CAKE FLANNEL ASSORTED COLOUR      -3150
PINK BLUE FELT CRAFT TRINKET BOX        -2617
WHITE HANGING HEART T-LIGHT HOLDER      -2578
GIN + TONIC DIET METAL SIGN             -2030
HERB MARKER BASIL                       -1527
FELTCRAFT DOLL MOLLY                    -1447

In [17]:
df_C.sort_values("Quantity", ascending=True).head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
540422,C581484,23843,"PAPER CRAFT , LITTLE BIRDIE",-80995,9/12/2011 9:27,2.08,16446,United Kingdom
61624,C541433,23166,MEDIUM CERAMIC TOP STORAGE JAR,-74215,18/1/2011 10:17,1.04,12346,United Kingdom
4268,C536757,84347,ROTATING SILVER ANGELS T-LIGHT HLDR,-9360,2/12/2010 14:23,0.03,15838,United Kingdom
160145,C550456,21108,FAIRY CAKE FLANNEL ASSORTED COLOUR,-3114,18/4/2011 13:08,2.10,15749,United Kingdom
160144,C550456,21175,GIN + TONIC DIET METAL SIGN,-2000,18/4/2011 13:08,1.85,15749,United Kingdom

In [18]:
df["Invoice"].nunique()

22190

It is necessary to create a new variable by multiplying two variables --> Price times Quantity

In [19]:
df["TotalPrice"] = df["Quantity"]*df["Price"]

In [20]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,1/12/2010 8:26,2.55,17850,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,1/12/2010 8:26,2.75,17850,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34

In [22]:
df.groupby(['Invoice','Description']).agg({'TotalPrice':'sum'}).sort_values('TotalPrice', ascending=False).head()

                                             TotalPrice
Invoice Description
581483  PAPER CRAFT , LITTLE BIRDIE           168469.60
541431  MEDIUM CERAMIC TOP STORAGE JAR         77183.60
556444  PICNIC BASKET WICKER 60 PIECES         38970.00
551697  POSTAGE                                 8142.75
567423  SET OF TEA COFFEE SUGAR TINS PANTRY     7144.72

the most expensive products

In [23]:
df.sort_values("Price", ascending = False).head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
222681,C556445,M,Manual,-1,10/6/2011 15:31,38970.00,15098,United Kingdom,-38970.00
173277,C551685,POST,POSTAGE,-1,3/5/2011 12:51,8142.75,16029,United Kingdom,-8142.75
173382,551697,POST,POSTAGE,1,3/5/2011 13:46,8142.75,16029,United Kingdom,8142.75
173391,C551699,M,Manual,-1,3/5/2011 14:12,6930.00,16029,United Kingdom,-6930.00
268027,C560372,M,Manual,-1,18/7/2011 12:26,4287.63,17448,United Kingdom,-4287.63

the product which we gained the most from

In [24]:
df.groupby("Description").agg({"TotalPrice":"sum"}).sort_values("TotalPrice", ascending = False).head(10)

                                    TotalPrice
Description
REGENCY CAKESTAND 3 TIER             132870.40
WHITE HANGING HEART T-LIGHT HOLDER    93823.85
JUMBO BAG RED RETROSPOT               83236.76
PARTY BUNTING                         67687.53
POSTAGE                               66728.24
ASSORTED COLOUR BIRD ORNAMENT         56499.22
RABBIT NIGHT LIGHT                    51137.80
CHILLI LIGHTS                         45936.81
PAPER CHAIN KIT 50'S CHRISTMAS        41500.48
PICNIC BASKET WICKER 60 PIECES        39619.50

create a dataframe that without C (refund)

In [26]:
df['Invoice'] = df['Invoice'].astype('str')
df2 = df[~df['Invoice'].str.contains('C')] 
df2.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,1/12/2010 8:26,2.55,17850,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,1/12/2010 8:26,2.75,17850,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34

In [28]:
df_C

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
141,C536379,D,Discount,-1,1/12/2010 9:41,27.50,14527,United Kingdom
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,1/12/2010 9:49,4.65,15311,United Kingdom
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,1/12/2010 10:24,1.65,17548,United Kingdom
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,1/12/2010 10:24,0.29,17548,United Kingdom
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,1/12/2010 10:24,0.29,17548,United Kingdom
...,...,...,...,...,...,...,...,...
540449,C581490,23144,ZINC T-LIGHT HOLDER STARS SMALL,-11,9/12/2011 9:57,0.83,14397,United Kingdom
541541,C581499,M,Manual,-1,9/12/2011 10:28,224.69,15498,United Kingdom
541715,C581568,21258,VICTORIAN SEWING BOX LARGE,-5,9/12/2011 11:57,10.95,15311,United Kingdom
541716,C581569,84978,HANGING HEART JAR T-LIGHT HOLDER,-1,9/12/2011 11:58,1.25,17315,United Kingdom
541717,C581569,20979,36 PENCILS TUBE RED RETROSPOT,-5,9/12/2011 11:58,1.25,17315,United Kingdom

the amount of each type product without refund

In [29]:
df2["Description"].value_counts().head()

Description
WHITE HANGING HEART T-LIGHT HOLDER    2028
REGENCY CAKESTAND 3 TIER              1724
JUMBO BAG RED RETROSPOT               1618
ASSORTED COLOUR BIRD ORNAMENT         1408
PARTY BUNTING                         1397
Name: count, dtype: int64

In [31]:
df2["Country"].value_counts().head()

Country
United Kingdom    354345
Germany             9042
France              8343
EIRE                7238
Spain               2485
Name: count, dtype: int64

The most profit that gains from those country

In [32]:
df.groupby("Country").agg({"TotalPrice":"sum"}).sort_values("TotalPrice", ascending = False).head()

                 TotalPrice
Country
United Kingdom  6767873.394
Netherlands      284661.540
EIRE             250285.220
Germany          221698.210
France           196730.840

Data Preparation

In [33]:
df2.shape

(397925, 9)

In [34]:
df2.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,1/12/2010 8:26,2.55,17850,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,1/12/2010 8:26,2.75,17850,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34

In [35]:
df2.describe([0.01,0.05,0.10,0.25,0.50,0.75,0.90,0.95, 0.99]).T

,count,mean,std,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
Quantity,397925.0,13.021793,180.419984,1.0,1.00,1.00,1.00,2.00,6.00,12.00,24.00,36.0,120.00,80995.00
Price,397925.0,3.116212,22.096773,0.0,0.21,0.42,0.55,1.25,1.95,3.75,6.35,8.5,14.95,8142.75
Customer ID,397925.0,15294.308601,1713.172738,12346.0,12415.00,12627.00,12883.00,13969.00,15159.00,16795.00,17725.00,17912.0,18211.00,18287.00
TotalPrice,397925.0,22.394737,309.055200,0.0,0.55,1.25,1.95,4.68,11.80,19.80,35.40,67.5,202.50,168469.60

In [36]:
for feature in ["Quantity","Price","TotalPrice"]:

    Q1 = df[feature].quantile(0.01)
    Q3 = df[feature].quantile(0.99)
    IQR = Q3-Q1
    upper = Q3 + 1.5*IQR
    lower = Q1 - 1.5*IQR

    if df[(df[feature] > upper) | (df[feature] < lower)].any(axis=None):
        print(feature,"yes")
        print(df[(df[feature] > upper) | (df[feature] < lower)].shape[0])
    else:
        print(feature, "no")

Quantity yes
948
Price yes
846
TotalPrice yes
1030

Customer Segmentation with RFM Scores

Recency --> RFM analysis date-Last purchase date

Frequency --> Total number of purchases, it shows how frequently the customer does shopping

Monetary --> Total spending by the customer

-> the process of separating these values into groups by scoring between 1 and 5

In [37]:
df2.head(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,1/12/2010 8:26,2.55,17850,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,1/12/2010 8:26,2.75,17850,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,1/12/2010 8:26,3.39,17850,United Kingdom,20.34
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,1/12/2010 8:26,7.65,17850,United Kingdom,15.30
6,536365,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,1/12/2010 8:26,4.25,17850,United Kingdom,25.50
7,536366,22633,HAND WARMER UNION JACK,6,1/12/2010 8:28,1.85,17850,United Kingdom,11.10
8,536366,22632,HAND WARMER RED POLKA DOT,6,1/12/2010 8:28,1.85,17850,United Kingdom,11.10
9,536368,22960,JAM MAKING SET WITH JARS,6,1/12/2010 8:34,4.25,13047,United Kingdom,25.50

In [38]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 397925 entries, 0 to 541909
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      397925 non-null  object
 1   StockCode    397925 non-null  object
 2   Description  397925 non-null  object
 3   Quantity     397925 non-null  int64
 4   InvoiceDate  397925 non-null  object
 5   Price        397925 non-null  float64
 6   Customer ID  397925 non-null  int64
 7   Country      397925 non-null  object
 8   TotalPrice   397925 non-null  float64
dtypes: float64(2), int64(2), object(5)
memory usage: 30.4+ MB

Recency

In [39]:
df2["InvoiceDate"].min()

'1/11/2011 10:02'

In [40]:
df2["InvoiceDate"].max()

'9/9/2011 9:52'

In [41]:
import datetime as dt
today_date = dt.datetime(2011,12,10)

In [42]:
today_date

datetime.datetime(2011, 12, 10, 0, 0)

In [77]:
df2.groupby("Customer ID").agg({"InvoiceDate":"max"}).head()

                    InvoiceDate
Customer ID
12346       2011-01-18 10:01:00
12347       2011-12-07 15:52:00
12348       2011-09-25 13:13:00
12349       2011-11-21 09:51:00
12350       2011-02-02 16:01:00

"InvoiceDate": "max" --> the most recent invoice date

In [52]:
print(df2['InvoiceDate'].dtypes)

object

In [54]:
df2['InvoiceDate_parsed'] = pd.to_datetime(
    df2['InvoiceDate'],
    dayfirst=True,
    infer_datetime_format=True,
    errors='coerce'
)

/var/folders/w0/_0zsjrz13ng4b0kpw069wgp5h183z6/T/ipykernel_2246/1996435588.py:1: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df2['InvoiceDate_parsed'] = pd.to_datetime(
/var/folders/w0/_0zsjrz13ng4b0kpw069wgp5h183z6/T/ipykernel_2246/1996435588.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['InvoiceDate_parsed'] = pd.to_datetime(

In [55]:
df2.groupby("Customer ID").agg({"InvoiceDate":"max"}).head()

                 InvoiceDate
Customer ID
12346        18/1/2011 10:01
12347         9/6/2011 13:01
12348         5/4/2011 10:47
12349        21/11/2011 9:51
12350         2/2/2011 16:01

For each customer, we need to subtract the customers' last purchase date from today's date.

In [82]:
df2['InvoiceDate'] = df2['InvoiceDate_parsed']

today = pd.Timestamp(today_date)

# Calculate recency (days since last purchase)
last_purchase = df2.groupby('Customer ID')['InvoiceDate'].max()
recency = (today - last_purchase).dt.days

# Keep as a temp dataframe
recency_df = recency.reset_index()
recency_df.columns = ['Customer ID', 'InvoiceDate']
recency_df.head()

/var/folders/w0/_0zsjrz13ng4b0kpw069wgp5h183z6/T/ipykernel_2246/1667253955.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['InvoiceDate'] = df2['InvoiceDate_parsed']

   Customer ID  InvoiceDate
0        12346          325
1        12347            2
2        12348           75
3        12349           18
4        12350          310

In [83]:
temp_df = (today_date - df2.groupby("Customer ID").agg({"InvoiceDate":"max"}))

In [84]:
(today_date - df2.groupby(["Customer ID","Description"]).agg({"InvoiceDate":"max"})).head(5)

                                                 InvoiceDate
Customer ID Description
12346       MEDIUM CERAMIC TOP STORAGE JAR 325 days 13:59:00
12347       3D DOG PICTURE PLAYING CARDS    39 days 11:35:00
            3D SHEET OF CAT STICKERS       246 days 13:17:00
            3D SHEET OF DOG STICKERS       246 days 13:17:00
            60 TEATIME FAIRY CAKE CASES     39 days 11:35:00

In [85]:
temp_df.rename(columns={"InvoiceDate": "Recency"}, inplace = True)

In [86]:
temp_df.head()

                      Recency
Customer ID
12346       325 days 13:59:00
12347         2 days 08:08:00
12348        75 days 10:47:00
12349        18 days 14:09:00
12350       310 days 07:59:00

In [87]:
recency_df = temp_df["Recency"].apply(lambda x: x.days)

In [88]:
recency_df.head()

Customer ID
12346    325
12347      2
12348     75
12349     18
12350    310
Name: Recency, dtype: int64

Frequency

In [89]:
temp_df = df2.groupby(["Customer ID","Invoice"]).agg({"Invoice":"count"})
temp_df.head()

                     Invoice
Customer ID Invoice
12346       541431         1
12347       537626        31
            542237        29
            549222        24
            556201        18

how many different products each customer bought

In [90]:
temp_df.groupby("Customer ID").agg({"Invoice":"sum"}).head()

             Invoice
Customer ID
12346              1
12347            182
12348             31
12349             73
12350             17

how many times the customer did shopping

In [91]:
temp_df.groupby("Customer ID").agg({"Invoice":"count"}).head()

             Invoice
Customer ID
12346              1
12347              7
12348              4
12349              1
12350              1

In [92]:
freq_df = temp_df.groupby("Customer ID").agg({"Invoice":"count"})
freq_df.rename(columns={"Invoice": "Frequency"}, inplace = True)
freq_df.head()

             Frequency
Customer ID
12346                1
12347                7
12348                4
12349                1
12350                1

The most frequency of customer

In [93]:
freq_df.sort_values("Frequency", ascending = False).head()

             Frequency
Customer ID
12748              210
14911              201
17841              124
13089               97
14606               93

Monetary

In [94]:
monetary_df = df2.groupby("Customer ID").agg({"TotalPrice":"sum"})
monetary_df.head()

             TotalPrice
Customer ID
12346          77183.60
12347           4310.00
12348           1797.24
12349           1757.55
12350            334.40

the customer which we gained the most money

In [95]:
monetary_df.sort_values(by="TotalPrice", ascending=False).head(10)

             TotalPrice
Customer ID
14646         280206.02
18102         259657.30
17450         194550.79
16446         168472.50
14911         143825.06
12415         124914.53
14156         117379.63
17511          91062.38
16029          81024.84
12346          77183.60

In [96]:
monetary_df.rename(columns={"TotalPrice": "Monetary"}, inplace = True)
monetary_df.head()

             Monetary
Customer ID
12346        77183.60
12347         4310.00
12348         1797.24
12349         1757.55
12350          334.40

In [97]:
print(recency_df.shape, freq_df.shape, monetary_df.shape)

(4339,) (4339, 1) (4339, 1)

In [98]:
recency_df.shape

(4339,)

Create a new data frame --> rfm

In [99]:
rfm = pd.concat([recency_df, freq_df, monetary_df],  axis=1)
rfm.head()

             Recency  Frequency  Monetary
Customer ID
12346            325          1  77183.60
12347              2          7   4310.00
12348             75          4   1797.24
12349             18          1   1757.55
12350            310          1    334.40

1 as the worst recency value ; 5 as the best recency value

the smaller recency value means more recent buy

In [100]:
rfm["RecencyScore"] = pd.qcut(rfm['Recency'], 5, labels = [5, 4, 3, 2, 1])

In [101]:
rfm

             Recency  Frequency  Monetary RecencyScore
Customer ID
12346            325          1  77183.60            1
12347              2          7   4310.00            5
12348             75          4   1797.24            2
12349             18          1   1757.55            4
12350            310          1    334.40            1
...              ...        ...       ...          ...
18280            277          1    180.60            1
18281            180          1     80.82            1
18282              7          2    178.05            5
18283              3         16   2094.88            5
18287             42          3   1837.28            3

[4339 rows x 4 columns]

In [102]:
rfm["Frequency"].describe([0.01,0.05,0.10,0.25,0.50,0.60,0.75,0.90,0.95, 0.99]).T

count    4339.000000
mean        4.271952
std         7.705493
min         1.000000
1%          1.000000
5%          1.000000
10%         1.000000
25%         1.000000
50%         2.000000
60%         3.000000
75%         5.000000
90%         9.000000
95%        13.000000
99%        30.000000
max       210.000000
Name: Frequency, dtype: float64

In [103]:
cut_bins = [0,1,2,3,9,210]

In [104]:
rfm["FrequencyScore"] = pd.cut(rfm["Frequency"], bins = cut_bins, labels = [1, 2, 3, 4, 5])
rfm["FrequencyScore"].value_counts()

FrequencyScore
1    1494
4    1111
2     835
3     508
5     391
Name: count, dtype: int64

In [105]:
rfm["MonetaryScore"] = pd.qcut(rfm['Monetary'], 5, labels = [1, 2, 3, 4, 5])
rfm.head()

,Recency,Frequency,Monetary,RecencyScore,FrequencyScore,MonetaryScore
Customer ID,,,,,,
12346,325,1,77183.60,1,1,5
12347,2,7,4310.00,5,4,5
12348,75,4,1797.24,2,4,4
12349,18,1,1757.55,4,1,4
12350,310,1,334.40,1,1,2

In [106]:
(rfm['RecencyScore'].astype(str) + 
 rfm['FrequencyScore'].astype(str) + 
 rfm['MonetaryScore'].astype(str)).head()

Customer ID
12346    115
12347    545
12348    244
12349    414
12350    112
dtype: object

In [107]:
rfm["RFM_SCORE"] = rfm['RecencyScore'].astype(str) + rfm['FrequencyScore'].astype(str) + rfm['MonetaryScore'].astype(str)
rfm.head()

,Recency,Frequency,Monetary,RecencyScore,FrequencyScore,MonetaryScore,RFM_SCORE
Customer ID,,,,,,,
12346,325,1,77183.60,1,1,5,115
12347,2,7,4310.00,5,4,5,545
12348,75,4,1797.24,2,4,4,244
12349,18,1,1757.55,4,1,4,414
12350,310,1,334.40,1,1,2,112

In [108]:
df[df["Customer ID"]==12347].head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
14938,537626,85116,BLACK CANDELABRA T-LIGHT HOLDER,12,7/12/2010 14:57,2.10,12347,Iceland,25.2
14939,537626,22375,AIRLINE BAG VINTAGE JET SET BROWN,4,7/12/2010 14:57,4.25,12347,Iceland,17.0
14940,537626,71477,COLOUR GLASS. STAR T-LIGHT HOLDER,12,7/12/2010 14:57,3.25,12347,Iceland,39.0
14941,537626,22492,MINI PAINT SET VINTAGE,36,7/12/2010 14:57,0.65,12347,Iceland,23.4
14942,537626,22771,CLEAR DRAWER KNOB ACRYLIC EDWARDIAN,12,7/12/2010 14:57,1.25,12347,Iceland,15.0

In [109]:
rfm.describe().T

,count,mean,std,min,25%,50%,75%,max
Recency,4339.0,92.041484,100.007757,0.0,17.000,50.00,141.50,373.00
Frequency,4339.0,4.271952,7.705493,1.0,1.000,2.00,5.00,210.00
Monetary,4339.0,2053.797166,8988.247836,0.0,307.245,674.45,1661.64,280206.02

In [110]:
#the champions:
rfm[rfm["RFM_SCORE"] == "555"].head()

,Recency,Frequency,Monetary,RecencyScore,FrequencyScore,MonetaryScore,RFM_SCORE
Customer ID,,,,,,,
12362,3,10,5226.23,5,5,5,555
12437,1,18,4951.41,5,5,5,555
12471,2,30,19824.05,5,5,5,555
12490,5,10,5417.93,5,5,5,555
12553,8,10,3692.28,5,5,5,555

In [111]:
seg_map = {
    r'[1-2][1-2]': 'Hibernating',
    r'[1-2][3-4]': 'At Risk',
    r'[1-2]5': 'Can\'t Lose',
    r'3[1-2]': 'About to Sleep',
    r'33': 'Need Attention',
    r'[3-4][4-5]': 'Loyal Customers',
    r'41': 'Promising',
    r'51': 'New Customers',
    r'[4-5][2-3]': 'Potential Loyalists',
    r'5[4-5]': 'Champions'
}

In [114]:
#Pull the value corresponding to the ranges of the score in the dictionary defined in 'seg_map', 
#and add it as a new column named "Segment":

rfm['Segment'] = rfm['RecencyScore'].astype(str) + rfm['FrequencyScore'].astype(str)
rfm['Segment'].head()

Customer ID
12346    11
12347    54
12348    24
12349    41
12350    11
Name: Segment, dtype: object

In [115]:
rfm['Segment'] = rfm['Segment'].replace(seg_map, regex=True)
rfm.head()

,Recency,Frequency,Monetary,RecencyScore,FrequencyScore,MonetaryScore,RFM_SCORE,Segment
Customer ID,,,,,,,,
12346,325,1,77183.60,1,1,5,115,Hibernating
12347,2,7,4310.00,5,4,5,545,Champions
12348,75,4,1797.24,2,4,4,244,At Risk
12349,18,1,1757.55,4,1,4,414,Promising
12350,310,1,334.40,1,1,2,112,Hibernating

In [116]:
need_attention_df = pd.DataFrame()
need_attention_df["Need_Attention_CustomerID"] = rfm[rfm["Segment"] == "Need Attention"].index
need_attention_df.head()

   Need_Attention_CustomerID
0                      12360
1                      12372
2                      12413
3                      12456
4                      12536

In [117]:
need_attention_df.to_csv("need_attention.csv")